//=============================================================================
//
// ライフクラス(life.h)
// Author : 髙野馨將
// 概要 : ライフ生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "life.h"
#include "game.h"
#include "player.h"

//=============================================================================
// インスタンス生成
// Author : 髙野馨將
// 概要 : 2Dオブジェクトを生成する
//=============================================================================
CLife * CLife::Create(void)
{
	// オブジェクトインスタンス
	CLife *pObject2D = nullptr;

	// メモリの解放
	pObject2D = new CLife;

	if (pObject2D != nullptr)
	{// 数値の初期化
		pObject2D->Init();
	}
	else
	{// メモリの確保ができなかった
		assert(false);
	}

	// インスタンスを返す
	return pObject2D;
}

//=============================================================================
// インスタンス生成
// Author : 髙野馨將
// 概要 : 2Dオブジェクトを生成する
//=============================================================================
CLife * CLife::Create(int nPriority)
{
	// オブジェクトインスタンス
	CLife *pObject2D = nullptr;

	// メモリの解放
	pObject2D = new CLife(nPriority);

	if (pObject2D != nullptr)
	{// 数値の初期化
		pObject2D->Init();
	}
	else
	{// メモリの確保ができなかった
		assert(false);
	}

	// インスタンスを返す
	return pObject2D;
}

//=============================================================================
// コンストラクタ
// Author : 髙野馨將
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CLife::CLife(int nPriority/* = PRIORITY_LEVEL0*/) : CObject2D(nPriority)
{

}

//=============================================================================
// デストラクタ
// Author : 髙野馨將
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CLife::~CLife()
{

}

//=============================================================================
// ライフの初期化
// Author : 髙野馨將
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CLife::Init()
{// オブジェクト2Dの初期化処理
	CObject2D::Init();
	//初期化
	SetCol(D3DXCOLOR(0.0f,1.0f,0.0f,1.0f));
	SetPos(D3DXVECTOR3(50.0f, 0.0f, 0.0f));

	return S_OK;
}

//=============================================================================
// ライフの終了
// Author : 髙野馨將
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CLife::Uninit()
{// オブジェクト2Dの終了処理
	CObject2D::Uninit();

	// オブジェクト2Dの解放
	Release();
}

//=============================================================================
// ライフの更新
// Author : 髙野馨將
// 概要 : ライフの更新を行う
//=============================================================================
void CLife::Update()
{
	// プレイヤーの情報を取得
	CPlayer *pPlayer = CGame::GetPlayer();
	if (pPlayer != nullptr)
	{
		// プレイヤーのライフを取得
		int nPlayerLife = pPlayer->GetLife();
		// ライフに応じてHPバーの大きさを変える
		SetSize(D3DXVECTOR3(100.0f * nPlayerLife, 100.0f, 0.0f));
		if (nPlayerLife <= 0)
		{
			Uninit();
		}
	}
}

//=============================================================================
// ライフの描画
// Author : 髙野馨將
// 概要 : ライフの描画を行う
//=============================================================================
void CLife::Draw()
{// オブジェクト2Dの描画処理
	CObject2D::Draw();
}