//=============================================================================
//
// 2Dリール(lille.cpp)
// Author : 唐﨑結斗
// 概要 : 2Dリール生成を行う
//
//=============================================================================

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NORMAL_RATIO (40)

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "lille.h"
#include "renderer.h"
#include "application.h"
#include "calculation.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : 2Dバレットを生成する
//=============================================================================
CLille * CLille::Create()
{
	// オブジェクトインスタンス
	CLille *pLille = nullptr;

	pLille = new CLille;

	// メモリの確保ができなかった
	assert(pLille != nullptr);

	// 数値の初期化
	pLille->Init();

	// インスタンスを返す
	return pLille;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CLille::CLille(int nPriority) : CObject2D(nPriority)
{
	
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CLille::~CLille()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : テクスチャの設定し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CLille::Init()
{
	// オブジェクト2Dの初期化
	CObject2D::Init();

	// テクスチャの設定
	LoadTex(0);

	// テクスチャ座標の設定
	SetTex(D3DXVECTOR2(0.0f, 0.0f), D3DXVECTOR2(1.0f / 10, 1.0f));

	m_nRatio = NORMAL_RATIO;				// 確率の設定
	m_bScroll = true;						// スクロール

	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CLille::Uninit()
{// オブジェクト2Dの終了
	CObject2D::Uninit();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 2D更新を行う
//=============================================================================
void CLille::Update()
{
	// オブジェクト2Dの更新
	CObject2D::Update();
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 2D描画を行う
//=============================================================================
void CLille::Draw()
{// プレイヤー2Dの描画
	CObject2D::Draw();
}

//=============================================================================
// 抽選
// Author : 唐﨑結斗
// 概要 : リールの抽選を行う
//=============================================================================
bool CLille::Lottery()
{
	// 結果
	bool bResult = false;

	if (CCalculation::Rand(100, 1) < m_nRatio)
	{// 当たった
		bResult = true;
	}

	return bResult;
}


