//=============================================================================
//
// 地雷クラス(skill.h)
// Author : 髙野馨將
// 概要 : オブジェクト生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "mine.h"
#include "collision_rectangle3D.h"
#include "renderer.h"
#include "game.h"
#include "player.h"
#include "application.h"

//=============================================================================
// インスタンス生成
// Author : 髙野馨將
// 概要 : 地雷を生成する
//=============================================================================
CMine * CMine::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// オブジェクトインスタンス
	CMine *pMine = nullptr;
	
	// メモリの解放
	pMine = new CMine;
	// メモリの確保ができなかった
	assert(pMine != nullptr);

	// エネミーの初期化
	pMine->Init();
	pMine->SetPos(pos);
	pMine->SetSize(size);
	pMine->m_pCollisionRectangle3D->SetSize(D3DXVECTOR3(size.x * 2.0f, size.y * 2.0f, 10.0f));

	// インスタンスを返す
	return pMine;
}

//=============================================================================
// コンストラクタ
// Author : 髙野馨將
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CMine::CMine()
{

}

//=============================================================================
// デストラクタ
// Author : 髙野馨將
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CMine::~CMine()
{

}

//=============================================================================
// 初期化
// Author : 髙野馨將
// 概要 : 初期化
//=============================================================================
HRESULT CMine::Init()
{// 初期化処理
	CSkill::Init();

	return S_OK;
}

//=============================================================================
// 終了
// Author : 髙野馨將
// 概要 : 地雷の解放
//=============================================================================
void CMine::Uninit()
{
	// 終了処理
	CSkill::Uninit();

	// 地雷の解放
	Release();
}

//=============================================================================
// 更新
// Author : 髙野馨將
// 概要 : 地雷更新を行う
//=============================================================================
void CMine::Update()
{// 更新処理

}

//=============================================================================
// 描画
// Author : 髙野馨將
// 概要 : 地雷描画を行う
//=============================================================================
void CMine::Draw()
{// 描画処理
	CSkill::Draw();
}