//=============================================================================
//
// 地雷クラス(skill.h)
// Author : 髙野馨將
// 概要 : オブジェクト生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "mine.h"
#include "collision_rectangle3D.h"
#include "renderer.h"
#include "game.h"
#include "enemy.h"
#include "player.h"
#include "application.h"

//=============================================================================
// インスタンス生成
// Author : 髙野馨將
// 概要 : 地雷を生成する
//=============================================================================
CMine * CMine::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, int nDamage)
{
	// オブジェクトインスタンス
	CMine *pMine = nullptr;
	
	// メモリの解放
	pMine = new CMine;
	// メモリの確保ができなかった
	assert(pMine != nullptr);

	// エネミーの初期化
	pMine->Init();
	pMine->m_nDamage = nDamage;
	pMine->SetPos(pos);
	pMine->SetSize(size);
	pMine->m_pCollisionRectangle3D->SetSize(D3DXVECTOR3(size.x * 2.0f, size.y * 2.0f, 10.0f));

	// インスタンスを返す
	return pMine;
}

//=============================================================================
// コンストラクタ
// Author : 髙野馨將
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CMine::CMine()
{
	// タイプの付与
	SetObjType(OBJETYPE_MINE);
}

//=============================================================================
// デストラクタ
// Author : 髙野馨將
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CMine::~CMine()
{

}

//=============================================================================
// 初期化
// Author : 髙野馨將
// 概要 : 初期化
//=============================================================================
HRESULT CMine::Init()
{// 初期化処理
	CSkill::Init();
	m_nDamage = 0;

	return S_OK;
}

//=============================================================================
// 終了
// Author : 髙野馨將
// 概要 : 地雷の解放
//=============================================================================
void CMine::Uninit()
{
	// 終了処理
	CSkill::Uninit();

	// 地雷の解放
	Release();
}

//=============================================================================
// 更新
// Author : 髙野馨將
// 概要 : 地雷更新を行う
//=============================================================================
void CMine::Update()
{// 更新処理
	// 当たり判定
	if (m_pCollisionRectangle3D->Collision(CObject::OBJETYPE_ENEMY, false))
	{
		// 当たった相手の情報を持ってくるを
		CEnemy *pEnemy = (CEnemy*)m_pCollisionRectangle3D->GetCollidedObj();
		//ライフの減少
		pEnemy->SetLife(pEnemy->GetLife() - m_nDamage);
		// 終了処理
		Uninit();

		return;
	}
}

//=============================================================================
// 描画
// Author : 髙野馨將
// 概要 : 地雷描画を行う
//=============================================================================
void CMine::Draw()
{// 描画処理
	CSkill::Draw();
}