//=============================================================================
//
// スキルクラス(skill.h)
// Author : 髙野馨將
// 概要 : オブジェクト生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "skill.h"
#include "collision_rectangle3D.h"
#include "renderer.h"
#include "game.h"
#include "player.h"
#include "application.h"

//=============================================================================
// インスタンス生成
// Author : 髙野馨將
// 概要 : スキルを生成する
//=============================================================================
CSkill * CSkill::Create(void)
{
	// オブジェクトインスタンス
	CSkill *pSkill = nullptr;

	// メモリの解放
	pSkill = new CSkill;

	// メモリの確保ができなかった
	assert(pSkill != nullptr);

	// インスタンスを返す
	return pSkill;
}

//=============================================================================
// コンストラクタ
// Author : 髙野馨將
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CSkill::CSkill()
{

}

//=============================================================================
// デストラクタ
// Author : 髙野馨將
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CSkill::~CSkill()
{

}

//=============================================================================
// 初期化
// Author : 髙野馨將
// 概要 : 初期化
//=============================================================================
HRESULT CSkill::Init()
{// 初期化処理
	CObject3D::Init();

	// 3D矩形の当たり判定の設定
	m_pCollisionRectangle3D = CCollision_Rectangle3D::Create();
	m_pCollisionRectangle3D->SetParent(this);
	m_pCollisionRectangle3D->SetPos(D3DXVECTOR3(0.0f, 0.0f, 0.0f));
	m_pCollisionRectangle3D->SetSize(D3DXVECTOR3(0.0f, 0.0f, 0.0f));

	return S_OK;
}

//=============================================================================
// 終了
// Author : 髙野馨將
// 概要 : スキルの解放
//=============================================================================
void CSkill::Uninit()
{
	// 終了処理
	CObject3D::Uninit();

	if (m_pCollisionRectangle3D != nullptr)
	{// 3D矩形の当たり判定の終了処理
		m_pCollisionRectangle3D->Uninit();
		m_pCollisionRectangle3D = nullptr;
	}

	// スキルの解放
	Release();
}

//=============================================================================
// 更新
// Author : 髙野馨將
// 概要 : スキル更新を行う
//=============================================================================
void CSkill::Update()
{// 更新処理

}

//=============================================================================
// 描画
// Author : 髙野馨將
// 概要 : スキル描画を行う
//=============================================================================
void CSkill::Draw()
{// 描画処理
	CObject3D::Draw();
}