//=============================================================================
//
// タイトルクラス(title.h)
// Author : 唐﨑結斗
// 概要 : タイトルクラスの管理を行う
//
//=============================================================================
#ifndef _TITLE_H_		// このマクロ定義がされてなかったら
#define _TITLE_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "scene_mode.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;

//=============================================================================
// シーンモードクラス
// Author : 唐﨑結斗
// 概要 : シーンモード生成を行うクラス
//=============================================================================
class CTitle : public CSceneMode
{
public:
	//--------------------------------------------------------------------
	// モードの列挙型
	// Author : 唐﨑結斗
	// 概要 : モードを識別する
	//--------------------------------------------------------------------
	enum NEXT_MODE
	{
		MODE_GAME = 0,			// ゲーム
		MODE_TUTORIAL,			// チュートリアル
		MODE_EXIT,				// 終了
		MAX_MODE,				// シーンの最大数
		MODE_NONE,				// シーン無し
	};

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CTitle();
	~CTitle() override;

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update() override;		// 更新
	void Draw() override;		// 描画

private:
	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	void FlashObj();
	void SelectMode();

	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	NEXT_MODE			m_nextMode;				// 次に設定するモード
	CObject2D			*m_pTitleLogo;			// タイトルロゴオブジェクト
	CObject2D			*m_pNewGame;			// ニューゲームオブジェクト
	CObject2D			*m_pTutorial;			// チュートリアルオブジェクト
	CObject2D			*m_pExit;				// 終了オブジェクト
	float				m_fAddAlpha;			// フレーム数のカウント
	int					m_nCntFrame;			// フレームカウント
	bool				m_bPressEnter;			// エンターキーを押せるか
};

#endif


